       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOPHEL.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY 'You are awesome man.'.
           STOP RUN.