       IDENTIFICATION DIVISION.
       PROGRAM-ID. HI.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY 'You are awesome man.'.
           STOP RUN.