       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM 5 TIMES
               DISPLAY "Hello I'm in a loop."
           END-PERFORM.
           
           STOP RUN.
